wolllis/esp8266_webradio/user/cgi.c
/*
 * ----------------------------------------------------------------------------
 * "THE BEER-WARE LICENSE" (Revision 42):
 * Jeroen Domburg <jeroen@spritesmods.com> wrote this file. As long as you retain 
 * this notice you can do whatever you want with this stuff. If we meet some day, 
 * and you think this stuff is worth it, you can buy me a beer in return. 
 * ----------------------------------------------------------------------------
 */

#include <esp8266.h>
#include "cgi.h"
#include "rboot-ota.h"
#include "timer.h"
#include "stdout.h"
#include "control.h"

//WiFi access point data
typedef struct
{
    char ssid[32];
    char bssid[8];
    int channel;
    char rssi;
    char enc;
} ApData;

//Scan result
typedef struct
{
    char scanInProgress; //if 1, don't access the underlying stuff from the webpage.
    ApData **apData;
    int noAps;
} ScanResultData;

//Static scan status storage.
static ScanResultData cgiWifiAps;

#define CONNTRY_IDLE 0
#define CONNTRY_WORKING 1
#define CONNTRY_SUCCESS 2
#define CONNTRY_FAIL 3
//Connection result var
static int connTryStatus = CONNTRY_IDLE;
static os_timer_t resetTimer;
static os_timer_t ScanTimeoutTimer;

// CGI code for stream control of index page
// This function is called every time a POST action is received for stream.cgi
int ICACHE_FLASH_ATTR IndexStreamCgi(HttpdConnData *connData)
{
    int len;
    char buff[1024];
    uint32 select = 0;



    len = httpdFindArg(connData->post->buff, "stream", buff, sizeof(buff));
    if (len != 0)
    {
        select = strtol(buff, NULL, 0);
    }

    len = httpdFindArg(connData->post->buff, "stream_control", buff, sizeof(buff));
    if (len != 0)
    {
        if (os_strcmp(buff, "PLAY") == 0)
        {
            HTTPC_vStartStreaming(&stream_address[select][0], "Icy-MetaData:1\r\n", Timer_StreamingCallback);
        }
        if (os_strcmp(buff, "STOP") == 0)
            HTTPC_vStopStreaming();
    }

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    httpdRedirect(connData, "index.html");
    return HTTPD_CGI_DONE;
}

// CGI code for playback control of index page
// This function is called every time a POST action is received for playback.cgi
int ICACHE_FLASH_ATTR IndexPlaybackCgi(HttpdConnData *connData)
{
    int len;
    char buff[1024];

    len = httpdFindArg(connData->post->buff, "autoplay", buff, sizeof(buff));
    if (len != 0)
    {
        Control_vSetAutoStart(strtol(buff, NULL, 0));
    }

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    httpdRedirect(connData, "index.html");
    return HTTPD_CGI_DONE;
}

// CGI code for volume control of index page
int ICACHE_FLASH_ATTR IndexVolumeCgi(HttpdConnData *connData)
{
    int len;
    char buff[1024];

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    len = httpdFindArg(connData->post->buff, "volume", buff, sizeof(buff));
    if (len != 0)
        Control_vSetVolume(strtol(buff, NULL, 0));

    httpdRedirect(connData, "index.tpl");
    return HTTPD_CGI_DONE;
}

// CGI code for enhancer control of index page
int ICACHE_FLASH_ATTR IndexEnhancerCgi(HttpdConnData *connData)
{
    int len;
    char buff[1024];
    Control_tstEnhancerSettings data_pointer;

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    // Get current settings
    Control_vGetEnhancer(&data_pointer);

    len = httpdFindArg(connData->post->buff, "treble_amp", buff, sizeof(buff));
    if (len != 0)
        data_pointer.TrebleAmp = strtol(buff, NULL, 0);

    len = httpdFindArg(connData->post->buff, "treble_lim", buff, sizeof(buff));
    if (len != 0)
        data_pointer.TrebleLim = strtol(buff, NULL, 0);

    len = httpdFindArg(connData->post->buff, "bass_amp", buff, sizeof(buff));
    if (len != 0)
        data_pointer.BassAmp = strtol(buff, NULL, 0);

    len = httpdFindArg(connData->post->buff, "bass_lim", buff, sizeof(buff));
    if (len != 0)
        data_pointer.BassLim = strtol(buff, NULL, 0);

    // Set new settings
    Control_vSetEnhancer(&data_pointer);

    httpdRedirect(connData, "index.html");
    return HTTPD_CGI_DONE;
}

// CGI code for spartial level control of index page
int ICACHE_FLASH_ATTR IndexSpartialCgi(HttpdConnData *connData)
{
    int len;
    char buff[1024];
    Control_tstEnhancerSettings data_pointer;

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    // Get current settings
    len=httpdFindArg(connData->post->buff, "SpartialProcessingLevel", buff, sizeof(buff));
    if (len!=0)
    {
        uint8 temp = strtol(buff, NULL, 0);
        Control_vSetSpartialProcessingLevel(temp);
        VS1053_vSetSpartialProcessing(temp);
    }

    httpdRedirect(connData, "index.html");
    return HTTPD_CGI_DONE;
}

// Default template code for the index page
// When index.html is initially loaded (or refreshed) this function is called to
// replace all %sometemplate% macro fields
int ICACHE_FLASH_ATTR IndexTemplate(HttpdConnData *connData, char *token, void **arg)
{
    char buf[100];
    Control_tstEnhancerSettings data_pointer;

    if (token == NULL)
        return HTTPD_CGI_DONE;

    // Macro "FIRMW_VERSION" is defined in makefile
    if (os_strcmp(token, "Version")==0)
        httpdSend(connData, FIRMW_VERSION, -1);

    // Macro "DEBUG_VERSION" is defined in makefile
#ifdef DEBUG_VERSION
    if (os_strcmp(token, "Debug")==0)
        httpdSend(connData, " Debug", -1);
#endif

    if (os_strcmp(token, "autoplay")==0)
        if(Control_u8GetAutoStart() == 1)
            httpdSend(connData, "checked='checked'", -1);

    if (os_strcmp(token, "volume")==0)
    {
        os_sprintf(buf, "%d", Control_u8GetVolume());
        httpdSend(connData, buf, -1);
    }

    if (os_strcmp(token, "treble_amp")==0)
    {
        Control_vGetEnhancer(&data_pointer);
        os_sprintf(buf, "%d", data_pointer.TrebleAmp);
        httpdSend(connData, buf, -1);
    }

    if (os_strcmp(token, "treble_lim")==0)
    {
        Control_vGetEnhancer(&data_pointer);
        os_sprintf(buf, "%d", data_pointer.TrebleLim);
        httpdSend(connData, buf, -1);
    }

    if (os_strcmp(token, "bass_amp")==0)
    {
        Control_vGetEnhancer(&data_pointer);
        os_sprintf(buf, "%d", data_pointer.BassAmp);
        httpdSend(connData, buf, -1);
    }

    if (os_strcmp(token, "bass_lim")==0)
    {
        Control_vGetEnhancer(&data_pointer);
        os_sprintf(buf, "%d", data_pointer.BassLim);
        httpdSend(connData, buf, -1);
    }

    if (os_strcmp(token, "SpartialProcessingLevel_Off")==0)
        if(Control_u8GetSpartialProcessingLevel() == Control_enSpartialProcessing_Off)
            httpdSend(connData, "checked='checked'", -1);

