wolllis/esp8266_webradio/user/cgi.c
    if (os_strcmp(token, "SpartialProcessingLevel_Minimal")==0)
        if(Control_u8GetSpartialProcessingLevel() == Control_enSpartialProcessing_Minimal)
            httpdSend(connData, "checked='checked'", -1);

    if (os_strcmp(token, "SpartialProcessingLevel_Normal")==0)
        if(Control_u8GetSpartialProcessingLevel() == Control_enSpartialProcessing_Normal)
            httpdSend(connData, "checked='checked'", -1);

    if (os_strcmp(token, "SpartialProcessingLevel_Extreme")==0)
        if(Control_u8GetSpartialProcessingLevel() == Control_enSpartialProcessing_Extreme)
            httpdSend(connData, "checked='checked'", -1);

    if (os_strcmp(token, "StreamSelected_0")==0)
        //if(Control_u8GetSpartialProcessingLevel() == Control_enSpartialProcessing_Extreme)
        httpdSend(connData, "checked='checked'", -1);

    if (os_strcmp(token, "StreamName_0")==0)
        httpdSend(connData, &stream_name[0][0], -1);
    if (os_strcmp(token, "StreamName_1")==0)
        httpdSend(connData, &stream_name[1][0], -1);
    if (os_strcmp(token, "StreamName_2")==0)
        httpdSend(connData, &stream_name[2][0], -1);

    return HTTPD_CGI_DONE;
}

//Cgi that turns the LED on or off according to the 'led' param in the POST data
int ICACHE_FLASH_ATTR cgiSettings(HttpdConnData *connData)
{
    int len;
    char buff[1024];

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    httpdRedirect(connData, "settings.tpl");
    return HTTPD_CGI_DONE;
}

//Template code for the settings page.
int ICACHE_FLASH_ATTR tplSettings(HttpdConnData *connData, char *token, void **arg)
{
    return HTTPD_CGI_DONE;
}

//Callback the code calls when a wlan ap scan is done. Basically stores the result in
//the cgiWifiAps struct.
void ICACHE_FLASH_ATTR wifiScanDoneCb(void *arg, STATUS status)
{
    int n;
    struct bss_info *bss_link = (struct bss_info*) arg;
    httpd_printf("wifiScanDoneCb %d\n", status);
    if (status != OK)
    {
        cgiWifiAps.scanInProgress = 0;
        return;
    }

    //Clear prev ap data if needed.
    if (cgiWifiAps.apData != NULL)
    {
        for (n = 0; n < cgiWifiAps.noAps; n++)
            free(cgiWifiAps.apData[n]);
        free(cgiWifiAps.apData);
    }

    //Count amount of access points found.
    n = 0;
    while (bss_link != NULL)
    {
        bss_link = bss_link->next.stqe_next;
        n++;
    }
    //Allocate memory for access point data
    cgiWifiAps.apData = (ApData**) malloc(sizeof(ApData*) * n);
    if (cgiWifiAps.apData == NULL)
    {
        printf("Out of memory allocating apData\n");
        return;
    }
    cgiWifiAps.noAps = n;
    httpd_printf("Scan done: found %d APs\n", n);

    //Copy access point data to the static struct
    n = 0;
    bss_link = (struct bss_info*) arg;
    while (bss_link != NULL)
    {
        if (n >= cgiWifiAps.noAps)
        {
            //This means the bss_link changed under our nose. Shouldn't happen!
            //Break because otherwise we will write in unallocated memory.
            httpd_printf("Huh? I have more than the allocated %d aps!\n", cgiWifiAps.noAps);
            break;
        }
        //Save the ap data.
        cgiWifiAps.apData[n] = (ApData*) malloc(sizeof(ApData));
        if (cgiWifiAps.apData[n] == NULL)
        {
            httpd_printf("Can't allocate mem for ap buff.\n");
            cgiWifiAps.scanInProgress = 0;
            return;
        }
        cgiWifiAps.apData[n]->rssi = bss_link->rssi;
        cgiWifiAps.apData[n]->channel = bss_link->channel;
        cgiWifiAps.apData[n]->enc = bss_link->authmode;
        strncpy(cgiWifiAps.apData[n]->ssid, (char* )bss_link->ssid, 32);
        strncpy(cgiWifiAps.apData[n]->bssid, (char* )bss_link->bssid, 6);

        bss_link = bss_link->next.stqe_next;
        n++;
    }
    //We're done.
    cgiWifiAps.scanInProgress = 0;
}

static void ICACHE_FLASH_ATTR ScanTimoutTimerCb(void *arg)
{
    struct ip_info ipinfo;
    struct station_config staConfig;
    wifi_station_get_config(&staConfig);
    // Station name set or not
    if (*staConfig.ssid == 0)
    {
        wifi_set_opmode(SOFTAP_MODE);

        wifi_softap_dhcps_stop();
        IP4_ADDR(&ipinfo.ip, 192, 168, 1, 1);
        IP4_ADDR(&ipinfo.gw, 192, 168, 1, 1);
        IP4_ADDR(&ipinfo.netmask, 255, 255, 255, 0);
        wifi_set_ip_info(SOFTAP_IF, &ipinfo);
        wifi_softap_dhcps_start();
    }
    else
    {
        wifi_set_opmode(STATION_MODE);
    }
}

//Routine to start a WiFi access point scan.
static void ICACHE_FLASH_ATTR wifiStartScan()
{
//	int x;
    if (cgiWifiAps.scanInProgress)
        return;
    cgiWifiAps.scanInProgress = 1;
    wifi_set_opmode(STATIONAP_MODE);
    wifi_station_scan(NULL, wifiScanDoneCb);

    //Schedule disconnect/connect
    os_timer_disarm(&ScanTimeoutTimer);
    os_timer_setfn(&ScanTimeoutTimer, ScanTimoutTimerCb, NULL);
    os_timer_arm(&ScanTimeoutTimer, 30000, 0); //time out after 15 secs of trying to connect
}

//This CGI is called from the bit of AJAX-code in wifi.tpl. It will initiate a
//scan for access points and if available will return the result of an earlier scan.
//The result is embedded in a bit of JSON parsed by the javascript in wifi.tpl.
int ICACHE_FLASH_ATTR cgiWiFiScan(HttpdConnData *connData)
{
    int pos = (int) connData->cgiData;
    int len;
    char buff[1024];

    if (!cgiWifiAps.scanInProgress && pos != 0)
    {
        //Fill in json code for an access point
        if (pos - 1 < cgiWifiAps.noAps)
        {
            len = sprintf(buff, "{\"essid\": \"%s\", \"bssid\": \"" MACSTR "\", \"rssi\": \"%d\", \"enc\": \"%d\", \"channel\": \"%d\"}%s\n", cgiWifiAps.apData[pos - 1]->ssid, MAC2STR(cgiWifiAps.apData[pos-1]->bssid), cgiWifiAps.apData[pos - 1]->rssi, cgiWifiAps.apData[pos - 1]->enc, cgiWifiAps.apData[pos - 1]->channel,
                    (pos - 1 == cgiWifiAps.noAps - 1) ? "" : ",");
            httpdSend(connData, buff, len);
        }
        pos++;
        if ((pos - 1) >= cgiWifiAps.noAps)
        {
            len = sprintf(buff, "]\n}\n}\n");
            httpdSend(connData, buff, len);
            //Also start a new scan.
            wifiStartScan();
            return HTTPD_CGI_DONE;
        }
        else
        {
            connData->cgiData = (void*) pos;
            return HTTPD_CGI_MORE;
        }
    }

    httpdStartResponse(connData, 200);
    httpdHeader(connData, "Content-Type", "text/json");
    httpdEndHeaders(connData);

