wolllis/esp8266_webradio/user/cgi.c
    if (cgiWifiAps.scanInProgress == 1)
    {
        //We're still scanning. Tell Javascript code that.
        len = sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"1\"\n }\n}\n");
        httpdSend(connData, buff, len);
        return HTTPD_CGI_DONE;
    }
    else
    {
        //We have a scan result. Pass it on.
        len = sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"0\", \n\"APs\": [\n");
        httpdSend(connData, buff, len);
        if (cgiWifiAps.apData == NULL)
            cgiWifiAps.noAps = 0;
        connData->cgiData = (void*) 1;
        return HTTPD_CGI_MORE;
    }
}

//Temp store for new ap info.
static struct station_config stconf;

//This routine is ran some time after a connection attempt to an access point. If
//the connect succeeds, this gets the module in STA-only mode.
static void ICACHE_FLASH_ATTR resetTimerCb(void *arg)
{
    int x = wifi_station_get_connect_status();
    if (x == STATION_GOT_IP)
    {
        //Go to STA mode. This needs a reset, so do that.
        httpd_printf("Got IP. Going into STA mode..\n");
        wifi_set_opmode(STATION_MODE);
        //Schedule disconnect/connect
        os_timer_disarm(&ScanTimeoutTimer);
        // Restart no longer needed after firmware v9.something
        //system_restart();
    }
    else
    {
        connTryStatus = CONNTRY_FAIL;
        httpd_printf("Connect fail. Not going into STA-only mode.\n");
        //Maybe also pass this through on the webpage?
    }
}

//Actually connect to a station. This routine is timed because I had problems
//with immediate connections earlier. It probably was something else that caused it,
//but I can't be arsed to put the code back :P
static void ICACHE_FLASH_ATTR reassTimerCb(void *arg)
{
    int x;
    httpd_printf("Try to connect to AP....\n");
    wifi_station_disconnect();
    wifi_station_set_config(&stconf);
    wifi_station_connect();
    x = wifi_get_opmode();
    connTryStatus = CONNTRY_WORKING;
    if (x != 1)
    {
        //Schedule disconnect/connect
        os_timer_disarm(&resetTimer);
        os_timer_setfn(&resetTimer, resetTimerCb, NULL);
        os_timer_arm(&resetTimer, 15000, 0); //time out after 15 secs of trying to connect
    }
}

//This cgi uses the routines above to connect to a specific access point with the
//given ESSID using the given password.
int ICACHE_FLASH_ATTR cgiWiFiConnect(HttpdConnData *connData)
{
    char essid[128];
    char passwd[128];
    static os_timer_t reassTimer;

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    httpdFindArg(connData->post->buff, "essid", essid, sizeof(essid));
    httpdFindArg(connData->post->buff, "passwd", passwd, sizeof(passwd));

    if (essid[0] == '$')
    {
        // hidden network
        httpdFindArg(connData->post->buff, "essid_hidden", essid, sizeof(essid));
    }

    strncpy((char* )stconf.ssid, essid, 32);
    strncpy((char* )stconf.password, passwd, 64);
    httpd_printf("Try to connect to AP %s pw %s\n", essid, passwd);

    //Schedule disconnect/connect
    os_timer_disarm(&reassTimer);
    os_timer_setfn(&reassTimer, reassTimerCb, NULL);
//Set to 0 if you want to disable the actual reconnecting bit
#ifdef DEMO_MODE
	httpdRedirect(connData, "/wifi");
#else
    os_timer_arm(&reassTimer, 500, 0);
    httpdRedirect(connData, "connecting.html");
#endif
    return HTTPD_CGI_DONE;
}

//This cgi uses the routines above to connect to a specific access point with the
//given ESSID using the given password.
int ICACHE_FLASH_ATTR cgiWiFiSetMode(HttpdConnData *connData)
{
    int len;
    char buff[1024];

    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    len = httpdFindArg(connData->getArgs, "mode", buff, sizeof(buff));
    if (len != 0)
    {
        httpd_printf("cgiWifiSetMode: %s\n", buff);
#ifndef DEMO_MODE
        wifi_set_opmode(strtol(buff, NULL, 0));
        system_restart();
#endif
    }
    httpdRedirect(connData, "/wifi");
    return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiWiFiConnStatus(HttpdConnData *connData)
{
    char buff[1024];
    int len;
    struct ip_info info;
    int st = wifi_station_get_connect_status();
    httpdStartResponse(connData, 200);
    httpdHeader(connData, "Content-Type", "text/json");
    httpdEndHeaders(connData);
    if (connTryStatus == CONNTRY_IDLE)
    {
        len = sprintf(buff, "{\n \"status\": \"idle\"\n }\n");
    }
    else
        if (connTryStatus == CONNTRY_WORKING || connTryStatus == CONNTRY_SUCCESS)
        {
            if (st == STATION_GOT_IP)
            {
                wifi_get_ip_info(0, &info);
                len = sprintf(buff, "{\n \"status\": \"success\",\n \"ip\": \"%d.%d.%d.%d\" }\n", (info.ip.addr >> 0) & 0xff, (info.ip.addr >> 8) & 0xff, (info.ip.addr >> 16) & 0xff, (info.ip.addr >> 24) & 0xff);
                //Reset into AP-only mode sooner.
                os_timer_disarm(&resetTimer);
                os_timer_setfn(&resetTimer, resetTimerCb, NULL);
                os_timer_arm(&resetTimer, 1000, 0);
            }
            else
            {
                len = sprintf(buff, "{\n \"status\": \"working\"\n }\n");
            }
        }
        else
        {
            len = sprintf(buff, "{\n \"status\": \"fail\"\n }\n");
        }

    httpdSend(connData, buff, len);
    return HTTPD_CGI_DONE;
}

//Template code for the WLAN page.
int ICACHE_FLASH_ATTR tplWlan(HttpdConnData *connData, char *token, void **arg)
{
    char buff[1024];
    int x;
    uint8 status;
    static struct station_config stconf;
    struct ip_info info;
    uint8 mac[6];

    if (token == NULL)
        return HTTPD_CGI_DONE;

    strcpy(buff, "Unknown");
    if (strcmp(token, "Wifi_Mode") == 0)
    {
        x = wifi_get_opmode();
        if (x == 1)
            strcpy(buff, "Client");
        if (x == 2)
            strcpy(buff, "AccessPoint");
        if (x == 3)
            strcpy(buff, "Client+AccessPoint");
    }
    else
        if (strcmp(token, "Wifi_SSID") == 0)
        {
            wifi_station_get_config(&stconf);
            strcpy(buff, (char* )stconf.ssid);
        }
        else
            if (strcmp(token, "Wifi_STATUS") == 0)
            {
                status = wifi_station_get_connect_status();
                if (status == STATION_IDLE)
                    strcpy(buff, "Basisstation nicht ausgewählt");
                if (status == STATION_CONNECTING)
                    strcpy(buff, "Verbindung wird aufgebaut");
                if (status == STATION_WRONG_PASSWORD)
                    strcpy(buff, "Passwort inkorrekt");
                if (status == STATION_NO_AP_FOUND)
                    strcpy(buff, "Basisstation nicht gefunden");
                if (status == STATION_CONNECT_FAIL)
                    strcpy(buff, "Verbindung fehlgeschlagen");
                if (status == STATION_GOT_IP)
                    strcpy(buff, "Verbunden");
            }
            else
                if (strcmp(token, "Wifi_IP") == 0)
                {
                    status = wifi_station_get_connect_status();
                    if (status == STATION_GOT_IP)
                    {
                        wifi_get_ip_info(0, &info);
                        sprintf(buff, "%d.%d.%d.%d", (info.ip.addr >> 0) & 0xff, (info.ip.addr >> 8) & 0xff, (info.ip.addr >> 16) & 0xff, (info.ip.addr >> 24) & 0xff);
                    }
                    else
                    {
                        strcpy(buff, "---");
                    }
                }
                else
                    if (strcmp(token, "Wifi_MAC") == 0)
                    {
                        wifi_get_macaddr(STATION_IF, mac);
                        sprintf(buff, "%02x:%02x:%02x:%02x:%02x:%02x", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
                    }

    httpdSend(connData, buff, -1);
    return HTTPD_CGI_DONE;
}

static struct espconn *conn;
ip_addr_t ip;
static os_timer_t ota_prepare_timer;

static const char* ICACHE_FLASH_ATTR esp_errstr(sint8 err)
{
    switch (err)
    {
        case ESPCONN_OK:
            return "No error, everything OK.";
        case ESPCONN_MEM:
            return "Out of memory error.";
        case ESPCONN_TIMEOUT:
            return "Timeout.";
        case ESPCONN_RTE:
            return "Routing problem.";
        case ESPCONN_INPROGRESS:
            return "Operation in progress.";
        case ESPCONN_ABRT:
            return "Connection aborted.";
        case ESPCONN_RST:
            return "Connection reset.";
        case ESPCONN_CLSD:
            return "Connection closed.";
        case ESPCONN_CONN:
            return "Not connected.";
        case ESPCONN_ARG:
            return "Illegal argument.";
        case ESPCONN_ISCONN:
            return "Already connected.";
    }
}

