wolllis/esp8266_webradio/user/cgi.c
// clean up at the end of the update
// will call the user call back to indicate completion
void ICACHE_FLASH_ATTR cgiOtaDeinit()
{
    os_timer_disarm(&ota_prepare_timer);

    // if connected, disconnect and clean up connection
    if (conn)
        espconn_disconnect(conn);
}

// called when connection receives data (hopefully the rom)
static void ICACHE_FLASH_ATTR cgiOtaReceiveCb(void *arg, char *pusrdata, unsigned short length)
{

    char *ptrData, *ptrLen, *ptr;

    // disarm the timer
    os_timer_disarm(&ota_prepare_timer);

    // valid http response?
    if ((ptrLen = (char*) os_strstr(pusrdata, "Content-Length: ")) && (ptrData = (char*) os_strstr(ptrLen, "\r\n\r\n")) && (os_strncmp(pusrdata + 9, "200", 3) == 0))
    {

        // end of header/start of data
        ptrData += 4;
        // length of data after header in this chunk
        length -= (ptrData - pusrdata);
        // process current chunk
        myprintf("OTA: Version found = %s\n", (uint8*) ptrData);

        // fail, not a valid http header/non-200 response/etc.
        cgiOtaDeinit();
    }
}

// disconnect callback, clean up the connection
// we also call this ourselves
static void ICACHE_FLASH_ATTR cgiOtaDisconnectCb(void *arg)
{
    // use passed ptr, as upgrade struct may have gone by now
    struct espconn *Conn = (struct espconn*) arg;

    os_timer_disarm(&ota_prepare_timer);

    if (Conn)
    {
        if (Conn->proto.tcp)
        {
            os_free(Conn->proto.tcp);
        }
        os_free(Conn);
    }
}

// successfully connected to update server, send the request
static void ICACHE_FLASH_ATTR cgiOtaConnectCb(void *arg)
{

    uint8 *request;

    // disable the timeout
    os_timer_disarm(&ota_prepare_timer);

    // register connection callbacks
    espconn_regist_disconcb(conn, cgiOtaDisconnectCb);
    espconn_regist_recvcb(conn, cgiOtaReceiveCb);

    // http request string
    request = (uint8*) os_malloc(512);
    if (!request)
    {
        myprintf("OTA: No ram!\n");
        cgiOtaDeinit();
        return;
    }
    os_sprintf((char*) request, "GET /wordclock_update/010_Version.txt HTTP/1.0\r\nHost: " OTA_HOST "\r\n" HTTP_HEADER);

    // send the http request, with timeout for reply
    os_timer_setfn(&ota_prepare_timer, (os_timer_func_t*) cgiOtaDeinit, 0);
    os_timer_arm(&ota_prepare_timer, 10000, 0);
    espconn_sent(conn, request, os_strlen((char*) request));
    os_free(request);
}

// call back for lost connection
static void ICACHE_FLASH_ATTR cgiOtaReconnectCb(void *arg, sint8 errType)
{
    myprintf("OTA: Connection error ");
    myprintf(esp_errstr(errType));
    myprintf("\n");
    // not connected so don't call disconnect on the connection
    // but call our own disconnect callback to do the cleanup
    cgiOtaDisconnectCb(conn);
}

// connection attempt timed out
static void ICACHE_FLASH_ATTR cgiOtaConnectTimeoutCb()
{
    myprintf("OTA: Connect timeout.\n");
    // not connected so don't call disconnect on the connection
    // but call our own disconnect callback to do the cleanup
    cgiOtaDisconnectCb(conn);
}

void ICACHE_FLASH_ATTR cgiOtaDnsIpFound(const char *name, ip_addr_t *ipaddr, void *arg)
{
    if (ipaddr == 0)
    {
        myprintf("OTA: DNS lookup failed for  ");
        myprintf(OTA_HOST);
        myprintf("\n");
        // not connected so don't call disconnect on the connection
        // but call our own disconnect callback to do the cleanup
        cgiOtaDisconnectCb(conn);
        return;
    }

    // set up connection
    conn->type = ESPCONN_TCP;
    conn->state = ESPCONN_NONE;
    conn->proto.tcp->local_port = espconn_port();
    conn->proto.tcp->remote_port = OTA_PORT;
    *(ip_addr_t*) conn->proto.tcp->remote_ip = *ipaddr;
    // set connection call backs
    espconn_regist_connectcb(conn, cgiOtaConnectCb);
    espconn_regist_reconcb(conn, cgiOtaReconnectCb);

    // try to connect
    espconn_connect(conn);

    // set connection timeout timer
    os_timer_disarm(&ota_prepare_timer);
    os_timer_setfn(&ota_prepare_timer, (os_timer_func_t*) cgiOtaConnectTimeoutCb, 0);
    os_timer_arm(&ota_prepare_timer, 10000, 0);
}

void ICACHE_FLASH_ATTR cgiPrepareOtaUpdate(void)
{
    err_t result;
    conn = (struct espconn*) os_zalloc(sizeof(struct espconn));

    if (!conn)
    {
        myprintf("No ram!\n");
        return;
    }
    // set up the udp "connection"
    conn->proto.tcp = (esp_tcp*) os_zalloc(sizeof(esp_tcp));
    if (!conn->proto.tcp)
    {
        myprintf("No ram!\n");
        os_free(conn);
        return;
    }

    // dns lookup
    result = espconn_gethostbyname(conn, OTA_HOST, &ip, cgiOtaDnsIpFound);

    if (result == ESPCONN_OK)
    {
        // hostname is already cached or is actually a dotted decimal ip address
        cgiOtaDnsIpFound(0, &ip, conn);
    }
    else
        if (result == ESPCONN_INPROGRESS)
        {
            // lookup taking place, will call upgrade_resolved on completion
        }
        else
        {
            myprintf("OTA: DNS error!\n");
            os_free(conn->proto.tcp);
            os_free(conn);
            return;
        }
}

// Handle request to update
int ICACHE_FLASH_ATTR cgiUpdateFirmware(HttpdConnData *connData)
{
    if (connData->conn == NULL)
    {
        //Connection aborted. Clean up.
        return HTTPD_CGI_DONE;
    }

    cgiPrepareOtaUpdate();

    httpdStartResponse(connData, 200);
    httpdHeader(connData, "Content-Type", "text/plain");
    httpdEndHeaders(connData);
    httpdSend(connData, "Upgrading...", -1);
    return HTTPD_CGI_DONE;
}

//Broadcast the Debug Output over connected websockets
void ICACHE_FLASH_ATTR websockDebugOut(char *buff)
{
    cgiWebsockBroadcast("/websocket/ws.cgi", buff, os_strlen(buff), WEBSOCK_FLAG_NONE);
}

//On reception of a message, send "You sent: " plus whatever the other side sent
void ICACHE_FLASH_ATTR myWebsocketRecv(Websock *ws, char *data, int len, int flags)
{
    int i;
    char buff[128];
    os_sprintf(buff, "You sent: ");
    for (i = 0; i < len; i++)
        buff[i + 10] = data[i];
    buff[i + 10] = 0;
    cgiWebsocketSend(ws, buff, os_strlen(buff), WEBSOCK_FLAG_NONE);
}

//Websocket connected. Install reception handler and send welcome message.
void ICACHE_FLASH_ATTR myWebsocketConnect(Websock *ws)
{
    ws->recvCb = myWebsocketRecv;
    // Here we are able to send some data to our new connected socket
    //cgiWebsocketSend(ws, "Hi, Websocket!", 14, WEBSOCK_FLAG_NONE);
}

//On reception of a message, echo it back verbatim
void ICACHE_FLASH_ATTR myEchoWebsocketRecv(Websock *ws, char *data, int len, int flags)
{
    os_printf("EchoWs: echo, len=%d\n", len);
    cgiWebsocketSend(ws, data, len, flags);
}

//Echo websocket connected. Install reception handler.
void ICACHE_FLASH_ATTR myEchoWebsocketConnect(Websock *ws)
{
    os_printf("EchoWs: connect\n");
    ws->recvCb = myEchoWebsocketRecv;
}
